app/controllers/animalcats_controller.rb

  def index
    @animalcats = Animalcat.all
---
SELECT `animalcats`.* FROM `animalcats`

  def update
    respond_to do |format|
      if @animalcat.update(animalcat_params)
---
UPDATE `animalcats` SET `video` = 'sasddasd', `updated_at` = '2017-10-16 21:08:18' WHERE `animalcats`.`id` = 3

    def set_animalcat
      @animalcat = Animalcat.find(params[:id])
---
SELECT  `animalcats`.* FROM `animalcats` WHERE `animalcats`.`id` = 3 LIMIT 1