app/controllers/articlecats_controller.rb

    def set_articlecat
      @articlecat = Articlecat.find(params[:id])
---
SELECT  `articlecats`.* FROM `articlecats` WHERE `articlecats`.`id` = 1 LIMIT 1