app/controllers/users_controller.rb

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `name` = '', `lastName` = 'asaa', `phone` = '', `street` = '', `exterior_number` = '', `interior_number` = '', `city` = '', `state` = '', `zip` = '', `updated_at` = '2017-10-16 20:35:14' WHERE `users`.`id` = 6